pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxScu_bf.h
/** \brief Mask for Ifx_SCU_CHIPID_Bits.VART */
#define IFX_SCU_CHIPID_VART_MSK (0x7u)

/** \brief Offset for Ifx_SCU_CHIPID_Bits.VART */
#define IFX_SCU_CHIPID_VART_OFF (28u)

/** \brief Length for Ifx_SCU_CHIPID_Bits.SEC */
#define IFX_SCU_CHIPID_SEC_LEN (1u)

/** \brief Mask for Ifx_SCU_CHIPID_Bits.SEC */
#define IFX_SCU_CHIPID_SEC_MSK (0x1u)

/** \brief Offset for Ifx_SCU_CHIPID_Bits.SEC */
#define IFX_SCU_CHIPID_SEC_OFF (31u)

/** \brief Length for Ifx_SCU_MANID_Bits.DEPT */
#define IFX_SCU_MANID_DEPT_LEN (5u)

/** \brief Mask for Ifx_SCU_MANID_Bits.DEPT */
#define IFX_SCU_MANID_DEPT_MSK (0x1fu)

/** \brief Offset for Ifx_SCU_MANID_Bits.DEPT */
#define IFX_SCU_MANID_DEPT_OFF (0u)

/** \brief Length for Ifx_SCU_MANID_Bits.MANUF */
#define IFX_SCU_MANID_MANUF_LEN (11u)

/** \brief Mask for Ifx_SCU_MANID_Bits.MANUF */
#define IFX_SCU_MANID_MANUF_MSK (0x7ffu)

/** \brief Offset for Ifx_SCU_MANID_Bits.MANUF */
#define IFX_SCU_MANID_MANUF_OFF (5u)

/** \brief Length for Ifx_SCU_SWAPCTRL_Bits.ADDRCFG */
#define IFX_SCU_SWAPCTRL_ADDRCFG_LEN (2u)

/** \brief Mask for Ifx_SCU_SWAPCTRL_Bits.ADDRCFG */
#define IFX_SCU_SWAPCTRL_ADDRCFG_MSK (0x3u)

/** \brief Offset for Ifx_SCU_SWAPCTRL_Bits.ADDRCFG */
#define IFX_SCU_SWAPCTRL_ADDRCFG_OFF (0u)

/** \brief Length for Ifx_SCU_SWAPCTRL_Bits.Spare */
#define IFX_SCU_SWAPCTRL_SPARE_LEN (14u)

/** \brief Mask for Ifx_SCU_SWAPCTRL_Bits.Spare */
#define IFX_SCU_SWAPCTRL_SPARE_MSK (0x3fffu)

/** \brief Offset for Ifx_SCU_SWAPCTRL_Bits.Spare */
#define IFX_SCU_SWAPCTRL_SPARE_OFF (2u)

/** \brief Length for Ifx_SCU_LBISTCTRL0_Bits.LBISTREQ */
#define IFX_SCU_LBISTCTRL0_LBISTREQ_LEN (1u)

/** \brief Mask for Ifx_SCU_LBISTCTRL0_Bits.LBISTREQ */
#define IFX_SCU_LBISTCTRL0_LBISTREQ_MSK (0x1u)

/** \brief Offset for Ifx_SCU_LBISTCTRL0_Bits.LBISTREQ */
#define IFX_SCU_LBISTCTRL0_LBISTREQ_OFF (0u)

/** \brief Length for Ifx_SCU_LBISTCTRL0_Bits.LBISTRES */
#define IFX_SCU_LBISTCTRL0_LBISTRES_LEN (1u)

/** \brief Mask for Ifx_SCU_LBISTCTRL0_Bits.LBISTRES */
#define IFX_SCU_LBISTCTRL0_LBISTRES_MSK (0x1u)

/** \brief Offset for Ifx_SCU_LBISTCTRL0_Bits.LBISTRES */
#define IFX_SCU_LBISTCTRL0_LBISTRES_OFF (1u)

/** \brief Length for Ifx_SCU_LBISTCTRL0_Bits.PATTERNS */
#define IFX_SCU_LBISTCTRL0_PATTERNS_LEN (18u)

/** \brief Mask for Ifx_SCU_LBISTCTRL0_Bits.PATTERNS */
#define IFX_SCU_LBISTCTRL0_PATTERNS_MSK (0x3ffffu)

/** \brief Offset for Ifx_SCU_LBISTCTRL0_Bits.PATTERNS */
#define IFX_SCU_LBISTCTRL0_PATTERNS_OFF (2u)

/** \brief Length for Ifx_SCU_LBISTCTRL0_Bits.LBISTDONE */
#define IFX_SCU_LBISTCTRL0_LBISTDONE_LEN (1u)

/** \brief Mask for Ifx_SCU_LBISTCTRL0_Bits.LBISTDONE */
#define IFX_SCU_LBISTCTRL0_LBISTDONE_MSK (0x1u)

/** \brief Offset for Ifx_SCU_LBISTCTRL0_Bits.LBISTDONE */
#define IFX_SCU_LBISTCTRL0_LBISTDONE_OFF (28u)

/** \brief Length for Ifx_SCU_LBISTCTRL0_Bits.LBISTERRINJ */
#define IFX_SCU_LBISTCTRL0_LBISTERRINJ_LEN (1u)

/** \brief Mask for Ifx_SCU_LBISTCTRL0_Bits.LBISTERRINJ */
#define IFX_SCU_LBISTCTRL0_LBISTERRINJ_MSK (0x1u)

/** \brief Offset for Ifx_SCU_LBISTCTRL0_Bits.LBISTERRINJ */
#define IFX_SCU_LBISTCTRL0_LBISTERRINJ_OFF (30u)

/** \brief Length for Ifx_SCU_LBISTCTRL0_Bits.LBISTREQRED */
#define IFX_SCU_LBISTCTRL0_LBISTREQRED_LEN (1u)

/** \brief Mask for Ifx_SCU_LBISTCTRL0_Bits.LBISTREQRED */
#define IFX_SCU_LBISTCTRL0_LBISTREQRED_MSK (0x1u)

/** \brief Offset for Ifx_SCU_LBISTCTRL0_Bits.LBISTREQRED */
#define IFX_SCU_LBISTCTRL0_LBISTREQRED_OFF (31u)

/** \brief Length for Ifx_SCU_LBISTCTRL1_Bits.SEED */
#define IFX_SCU_LBISTCTRL1_SEED_LEN (19u)

/** \brief Mask for Ifx_SCU_LBISTCTRL1_Bits.SEED */
#define IFX_SCU_LBISTCTRL1_SEED_MSK (0x7ffffu)

/** \brief Offset for Ifx_SCU_LBISTCTRL1_Bits.SEED */
#define IFX_SCU_LBISTCTRL1_SEED_OFF (0u)

/** \brief Length for Ifx_SCU_LBISTCTRL1_Bits.SPLITSH */
#define IFX_SCU_LBISTCTRL1_SPLITSH_LEN (3u)

/** \brief Mask for Ifx_SCU_LBISTCTRL1_Bits.SPLITSH */
#define IFX_SCU_LBISTCTRL1_SPLITSH_MSK (0x7u)

/** \brief Offset for Ifx_SCU_LBISTCTRL1_Bits.SPLITSH */
#define IFX_SCU_LBISTCTRL1_SPLITSH_OFF (24u)

/** \brief Length for Ifx_SCU_LBISTCTRL1_Bits.BODY */
#define IFX_SCU_LBISTCTRL1_BODY_LEN (1u)

/** \brief Mask for Ifx_SCU_LBISTCTRL1_Bits.BODY */
#define IFX_SCU_LBISTCTRL1_BODY_MSK (0x1u)

/** \brief Offset for Ifx_SCU_LBISTCTRL1_Bits.BODY */
#define IFX_SCU_LBISTCTRL1_BODY_OFF (27u)

/** \brief Length for Ifx_SCU_LBISTCTRL1_Bits.LBISTFREQU */
#define IFX_SCU_LBISTCTRL1_LBISTFREQU_LEN (4u)

/** \brief Mask for Ifx_SCU_LBISTCTRL1_Bits.LBISTFREQU */
#define IFX_SCU_LBISTCTRL1_LBISTFREQU_MSK (0xfu)

/** \brief Offset for Ifx_SCU_LBISTCTRL1_Bits.LBISTFREQU */
#define IFX_SCU_LBISTCTRL1_LBISTFREQU_OFF (28u)

/** \brief Length for Ifx_SCU_LBISTCTRL2_Bits.LENGTH */
#define IFX_SCU_LBISTCTRL2_LENGTH_LEN (12u)

/** \brief Mask for Ifx_SCU_LBISTCTRL2_Bits.LENGTH */
#define IFX_SCU_LBISTCTRL2_LENGTH_MSK (0xfffu)

/** \brief Offset for Ifx_SCU_LBISTCTRL2_Bits.LENGTH */
#define IFX_SCU_LBISTCTRL2_LENGTH_OFF (0u)

/** \brief Length for Ifx_SCU_LBISTCTRL3_Bits.SIGNATURE */
#define IFX_SCU_LBISTCTRL3_SIGNATURE_LEN (32u)

/** \brief Mask for Ifx_SCU_LBISTCTRL3_Bits.SIGNATURE */
#define IFX_SCU_LBISTCTRL3_SIGNATURE_MSK (0xffffffffu)

/** \brief Offset for Ifx_SCU_LBISTCTRL3_Bits.SIGNATURE */
#define IFX_SCU_LBISTCTRL3_SIGNATURE_OFF (0u)

/** \brief Length for Ifx_SCU_STMEM1_Bits.MEM */
#define IFX_SCU_STMEM1_MEM_LEN (32u)

/** \brief Mask for Ifx_SCU_STMEM1_Bits.MEM */
#define IFX_SCU_STMEM1_MEM_MSK (0xffffffffu)

/** \brief Offset for Ifx_SCU_STMEM1_Bits.MEM */
#define IFX_SCU_STMEM1_MEM_OFF (0u)

/** \brief Length for Ifx_SCU_STMEM2_Bits.MEM */
#define IFX_SCU_STMEM2_MEM_LEN (32u)

/** \brief Mask for Ifx_SCU_STMEM2_Bits.MEM */
#define IFX_SCU_STMEM2_MEM_MSK (0xffffffffu)

/** \brief Offset for Ifx_SCU_STMEM2_Bits.MEM */
#define IFX_SCU_STMEM2_MEM_OFF (0u)

/** \brief Length for Ifx_SCU_PDISC_Bits.PDIS0 */
#define IFX_SCU_PDISC_PDIS0_LEN (1u)

/** \brief Mask for Ifx_SCU_PDISC_Bits.PDIS0 */
#define IFX_SCU_PDISC_PDIS0_MSK (0x1u)

/** \brief Offset for Ifx_SCU_PDISC_Bits.PDIS0 */
#define IFX_SCU_PDISC_PDIS0_OFF (0u)

/** \brief Length for Ifx_SCU_PDISC_Bits.PDIS1 */
#define IFX_SCU_PDISC_PDIS1_LEN (1u)

/** \brief Mask for Ifx_SCU_PDISC_Bits.PDIS1 */
#define IFX_SCU_PDISC_PDIS1_MSK (0x1u)

/** \brief Offset for Ifx_SCU_PDISC_Bits.PDIS1 */
#define IFX_SCU_PDISC_PDIS1_OFF (1u)

/** \brief Length for Ifx_SCU_PMTRCSR0_Bits.LJTEN */
#define IFX_SCU_PMTRCSR0_LJTEN_LEN (1u)

